/* ************************************************************************************************** */
/* ************************************************************************************************** */
/* ************************************************************************************************** */
/* ************************************************************************************************** */
/*   ----------------------------------------------------------------------------------------------   */
/*                                          小鸡叽叽科技出品		                                  		*/
/*                                         www.xiaojijiji.com		                                  		*/
/*   ----------------------------------------------------------------------------------------------   */
/* ************************************************************************************************** */
/* ************************************************************************************************** */
/* ************************************************************************************************** */
/* ************************************************************************************************** */
/*   -----------------------------------------------------------------------------------------------  */
/*	                     感谢您支持小鸡叽叽科技，请遵守保密协议，保护作者的劳动成果，                 */
/*                                  未经允许请不要将资料、代码传送他人或者网络	                      */
/*																		         仅供内部使用                                           */
/* ************************************************************************************************** */




#include "Reg_SP37.h"
#include "SP37_ROMLibrary.h"
#include <uart.h>
#include <stdio.h>
#include <ctype.h>

idata ID_Struct ID_Result;

void MAIN(void)
{
	//Input Parameter:2 Samples
	unsigned int SensorConfig = (1<<7) | 1;

	//Input Parameter: SampleRate
	unsigned char SampleRate = 0x00;

	unsigned char StatusByte;
	struct {
		signed int Compensated_Pressure;
		signed int Raw_Pressure;
		signed int Raw_Temperature;
	}idata Press_Result;

	Uart_Init();

	while(1){
		
		WDRES = 1;	//喂看门狗
		
		StatusByte = Meas_Pressure(SensorConfig,SampleRate,&Press_Result.Compensated_Pressure);

		if(!StatusByte)
		{
			printf("the Pressure = %f kPa\r\n",(double)Press_Result.Compensated_Pressure/16.0);
		}
		else
		{
			printf("Sorry Meas_Pressure Error!\r\n");
		}

		Wait100usMultiples(10000);
	}
	
}




