/* ************************************************************************************************** */
/* ************************************************************************************************** */
/* ************************************************************************************************** */
/* ************************************************************************************************** */
/*   ----------------------------------------------------------------------------------------------   */
/*                                          小鸡叽叽科技出品		                                  		*/
/*                                         www.xiaojijiji.com		                                  		*/
/*   ----------------------------------------------------------------------------------------------   */
/* ************************************************************************************************** */
/* ************************************************************************************************** */
/* ************************************************************************************************** */
/* ************************************************************************************************** */
/*   -----------------------------------------------------------------------------------------------  */
/*	                     感谢您支持小鸡叽叽科技，请遵守保密协议，保护作者的劳动成果，                 */
/*                                  未经允许请不要将资料、代码传送他人或者网络	                      */
/*																		         仅供内部使用                                           */
/* ************************************************************************************************** */



#include "Reg_SP37.h"
#include "SP37_ROMLibrary.h"
#include <uart.h>
#include <stdio.h>
#include <ctype.h>


void MAIN(void)
{
	//new raw temperature | Average value | 8 Samples
	unsigned int SensorConfig = (0<<8) | (0<<3) | (3<<0);
	//00H: No delay
	unsigned char SampRate = 0x00;
	unsigned char StatusByte;
	struct {
		signed int Compensated_Acceleration;
		signed int Raw_Acceleration_Data;
		signed int Raw_Temperature;
	} idata AccelResult;

	//串口初始化
	Uart_Init();

	while(1)
	{
		WDRES = 1;
		
		StatusByte = Meas_Acceleration(SensorConfig,SampRate,&AccelResult.Compensated_Acceleration);
		if(!StatusByte)
		{
			printf("The Acceleration = %f g\r\n",(float)AccelResult.Compensated_Acceleration/16);			
		}
		else
		{
			printf("Sorry Acceleration Measure Error\r\n");
		}
		Wait100usMultiples(1000);
	}

}




